package Practica;

/*Изоморфизм строк
 Даны две строки s и t. Определите изоморфны ли они.
  Две строки s и t называются изоморфными, если можно сделать замену символов в строке s,
  чтобы получить строку t, при этом: 1. Все вхождения заменяемого символа должны быть заменены
  заменяющим символом 2. Никакие два разных символа не могут быть заменены на один и тот же символ 3.
  Символ может быть заменен сам на себя

   Формат ввода
Во входном файле input.txt (или в стандартном потоке ввода) первая строка содержит первую строку
s, вторая строка - вторую строку t.

Формат вывода
В единственную строку выходного файла output.txt (или стандартный поток вывода) запишите
true, если строки являются изоморфными, или false, если не являются.

Пример 1
Ввод
tea
sea

Вывод
true


Пример 2
Ввод
egg
add

Вывод
true


Пример 3
Ввод
foo
bar

Вывод
false

Пример 4
Ввод
paper
title

Вывод
true

Пример 5
Ввод
a
a

Вывод
true

Пример 6
Ввод
a
aa

Вывод
false

Примечание
Длины строк ограничены 10^6 символов, в строках могут содержаться любые символы.

Ограничение памяти
64.0 Мб

Ограничение времени
1 с

Ввод
стандартный ввод или input.txt

Вывод
стандартный вывод или output.txt
   */

public class Yandex2 {
    public static void main(String[] args) {

    }
}
